let IOCs = dynamic(["b32317fcf295b75d6e089ca42a323f5d" ,"dc8c26c71e885b085af967f819d7f9ac0f9809b7" ,"aec47e12f0cb9fbb3d99faa5bdb58f9ece03a1da2a497431221e293b5c55b211" ,"a24dea9616c4047b172e61309becccc8" ,"9bbf5f29c3e11956b84a50e8b6aa3a41bbc225ea" ,"36c85c0ba7046433c48af6d2492dfdcd0f5c7ee26b137249acc7de4ab48ea6e2" ,"a57ed12aaf054f69c1442410fecdfaf6" ,"88027d16b91e313aaf74271543dffa0975ff7249" ,"29b3c4c96dd932f3e6b828a8a147ec25664913391c30406e2cca638fb1962567" "422e0e4e01c826c8a9f31cb3a3b37ba29fb4b4b8c4841e16194258435056d8a3" ,"a0138b24593483f50ae7656985b6d6cfe77f7676ba374026199ad49ad26f2992" ,"cb239d641cfa610b1eaf0ecd0f48c42dd147f547b888e4505297c4e9521d8afe" ,"fafbe16c5646bf1776dd3ef62ba905b9b2cb0ee51043859a2f3cdda7dfe20d4c" ,"f040239f22c2d4bfa97d53eb4a73e98d0105eb6c" ,"f0ff1059e64175c8bf3f557cf1b0f49ed105d7d4" ,"2e8d8629352682d37479c6d0e87b9f8ec1a0819f" ,"7a207db4d2a447a3c547fda5f34d3f6efda5dcf9" ,"f716efddcb69efb3d59bc768775e8d12" ,"fd3bed7ce09d21f3220db1feec418805" ,"5a7fca904daab425e34967f803d507e1f67" ,"be2151dad4ef1474967f803d507e1f67" ,"4c0b556dcbe63a9c4656cdceee745d87" ,"c19eca0e1d4017992532e735d6cd6a66" ,"e490f5d266d2269cc188870af72e76a8" ,"ff696f61f3ffd500ade82b79d5919a61" ,"9e65daf83bc0f87a7c76c6a645ccd8a0" ,"a40be7c36df5bd48efe9f0409c32c3f0" ,"f1a5d0904f42c3870830d49364d7124e" ,"4b99d9d18c858fe6cbf675ee742bd647" ,"20168e7febfd0f9c5781c6fcb15e350e" ,"3db3a5cb290ae35596e45df7c3cf0693" ,"7e537600ac0527db98cef7c0117aa403" ,"bbac4961abdf124914ab4a5f4465a284" ,"17261c449c565ed96200a6a440841254" ,"a9bc1346a393749721476814a85540ab" ,"02448cf9327f3adb0a9f8ee7379d7feb" ,"259750d0793cf0ccf647f7ef7eda6c5f" ,"97cea8a567f863fb837362df671df457" ,"fc20063993ed2baaa24d41ad11c0f258bab5bd7f" ,"d639821e3fbbb15e14b46aed5b98568e3ce045c3" ,"7cb0346e458efb75edeb19e7a1bf6898a51162bf" ,"NLBrute.exe" ,"KPortScan3.exe" ,"5-NSnew.exe" ,"111.zip" ,"!start.bat" ,"id_authorization.txt" ,"hard.txt" ,"Private.txt"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SHA256 has_any (IOCs) or SHA1 has_any (IOCs) or MD5 has_any (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs) or InitiatingProcessMD5 has_any (IOCs) or FolderPath has_any (IOCs) or ProcessName has_any (IOCs) or NewProcessName has_any (IOCs) or ParentProcessName has_any (IOCs) or InitiatingProcessFolderPath has_any (IOCs) or InitiatingProcessParentFileName has_any (IOCs) or InitiatingProcessFileName has_any (IOCs) or FileName has_any (IOCs) 
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP, DestinationIP, LocalIP, RemoteIP, SenderIPv4, RequestURL, Url, RemoteUrl, SHA256, SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256