DeviceProcessEvents
| where TimeGenerated >= ago(30d)
| where FileName in ("mimikatz.exe", "nlbrute.exe", "kportscan3.exe", "advancedportscanner.exe", "5-ns new.exe", "lazagne.exe")
    or ProcessCommandLine has_any ("!start.bat", "mimikatz", "miparser.vbs", "nirsoft") 
| project TimeGenerated, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, FolderPath, AccountName
| union (
    DeviceFileEvents
    | where TimeGenerated >= ago(30d)
    | where FileName =~ "Result.txt"
    | where FolderPath has_any ("!logs", "mimikatz")
    | project TimeGenerated, DeviceName, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine
)