let IOCs = dynamic(["48ea05548fa01cb85ebb2fd58663bedf","0948e75c94046f0893844e3b891556ea48188608","b00af0dedb5c4d8f62ca0baf941e18a93e868881bd2c37dadda4815e07ca2117","d396525d713050aeaea527c4125fe3da","dcd859e5b14657b733dfb0c22272b82623466321","0c0837744202ff2d0fc920219229d00043a8d1d881f5fdd918fa6ee8282c0077"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SHA256 has_any (IOCs) or SHA1 has_any (IOCs) or MD5 has_any (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs) or InitiatingProcessMD5 has_any (IOCs) or FolderPath has_any (IOCs) or ProcessName has_any (IOCs) or NewProcessName has_any (IOCs) or ParentProcessName has_any (IOCs) or InitiatingProcessFolderPath has_any (IOCs) or InitiatingProcessParentFileName has_any (IOCs) or InitiatingProcessFileName has_any (IOCs) or FileName has_any (IOCs) 
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP, DestinationIP, LocalIP, RemoteIP, SenderIPv4, RequestURL, Url, RemoteUrl, SHA256, SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256