let IOCs = dynamic(["5f8c6e6b1081487e8b546ab326243771" ,"e7bbd9aa69ec4e60bf53cb5de464aa5165fd763f" ,"5c0e3209559f83788275b73ac3bcc61867ece6922afabe3ac672240c1c46b1d3" ,"b6c6c5212f20262a708ff1dfe3de10ed" ,"4818df16ad16d666ed536e8cad9f6f781a63ced8" ,"c1322b21eb3f300a7ab0f435d6bcf6941fd0fbd58b02f7af797af464c920040a" ,"b3e7e1eedd8e502fb9a5a512944b30cb" ,"8a6f67eebc74c8233f7c3af89f194f021cff2805" ,"3dfa22389fe1a2e4628c2951f1756005a0b9effdab8de3b0f6bb36b764e2b84a" ,"3f2cb64532110ec9387a8ac9d08dce16" ,"435130c3267e9648111e5ee95fcd123198d03994" ,"bb05f1ef4c86620c6b7e8b3596398b3b2789d8e3b48138e12a59b362549b799d" ,"67991ce76f09043854479bf9eae440ef" ,"66d1dcd5e165fd611445c9b624fcd693bc1a3ed3" ,"0f1fdbc5adb37f1de0a586e9672a28a5d77f3ca4eff8e3dcf6392c5e4611f914" ,"28129921ed134f29653691ffc6e600ff" ,"b646742573f7a104f1d83ab6a5dcbd8c6b417370" ,"917e5c0a8c95685dc88148d2e3262af6c00b96260e5d43fe158319de5f7c313e" ,"wincontrolscenter86br1.exe" ,"msys-crypto-3.dll" ,"msys-2.0.dll" ,"msys-gcc_s-seh-1.dll" ,"upseisser.zip"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SHA256 has_any (IOCs) or SHA1 has_any (IOCs) or MD5 has_any (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs) or InitiatingProcessMD5 has_any (IOCs) or FolderPath has_any (IOCs) or ProcessName has_any (IOCs) or NewProcessName has_any (IOCs) or ParentProcessName has_any (IOCs) or InitiatingProcessFolderPath has_any (IOCs) or InitiatingProcessParentFileName has_any (IOCs) or InitiatingProcessFileName has_any (IOCs) or FileName has_any (IOCs) 
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP, DestinationIP, LocalIP, RemoteIP, SenderIPv4, RequestURL, Url, RemoteUrl, SHA256, SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256