DeviceProcessEvents
| where TimeGenerated > ago(30d)
| where FileName in~ ("powershell.exe","pwsh.exe","wscript.exe","cscript.exe","mshta.exe","rundll32.exe","regsvr32.exe","cmd.exe")
| where ProcessCommandLine has_any ("DownloadString","Invoke-WebRequest","iwr ","curl ","wget ","FromBase64String","-enc","-encodedcommand","bitsadmin","certutil","mshta http")
| where ProcessCommandLine !contains "IABbAEUAbgB2AGkAcgBvAG4AbQBlAG4AdABdADoA" and ProcessCommandLine !contains "JABFAHIAcgBvAHIAQQBjAHQAaQBvAG4AUAByAGUAZgBlAHIAZ"
| where AccountName != @"u_coleta_servicenow"
| project Timestamp, DeviceName, AccountName, FileName, ProcessCommandLine,
          InitiatingProcessParentFileName, InitiatingProcessCommandLine
| order by Timestamp desc