let IOCs = dynamic(["a83639e65bf14d8a1a1dcbbbbc96e05a" ,"b5cdb3a67908b9ec8c96aabdceb6788841097820" ,"293d4db492cdea1da4f4a3b58e83331f" ,"300bcd3a8a0a5a0597b8e469ab4e2f4c86aa4434" ,"2965ddbcd11a08a3ca159af187ef754c" ,"1c85aa9f61d92cfb9107b8ec5303ed60990509b1" ,"238206aec34cedba2910c1fb2a997151" ,"45c70be2c3107e72fcf8f3c34699f7d52e011abc" ,"2e84ea5cef8a9a8a60c7553b5878a349a037cffeab4c7f40da5d0873ede7ff72" ,"e2f6e722c26e19b76396c2502cacf2aaceaaa1486865578c665ebf0065641ffa" ,"f9dd0b57a5c133ca0c4cab3cca1ac8debdc4a798b452167a1e5af78653af00c1" ,"a86e72ca58de6d215a59ae233963eaea27fe47ef0c9f43938e27339df4a86732" ,"7efe5c1229178c1b48f6750c846575e7f48d17ea817997bd7acba0e5ecf1e577" ,"D88115113E274071B03A3B4C1DA99EAEA7B8D94ADF833DFD26943AF0A6D78B4D" ,"f094ff83d4b7d06bc17b15db7d7dc0e622778b0eda71e8fc9fdf7db83c460426" ,"36f00887f6c0af63ef3c70a60a540c64040b13a4209b975e96ce239e65548d4a" ,"ecf0fbd72aac684b03930ad2ff9cdd386e9c13ddf449f27918f337dc8963590e" ,"2b57deb1f6f7d5448464b88bd96b47c5e2bd6e1c64c1b9214b57c4d35a591279" ,"b4a53f117722fb4af0a64d30ec8aa4c4c82f456e3d2a5c5111c63ce261f3b547" ,"866fde351251092fb5532e743459ba80968cd5516cce813c8755467f5e8a47a1" ,"188ab2d68f17ecf08a7a4cfc6457c79b0a5117b3277352a7371a525416129114" ,"809ddcbb64d6f2ccc4a8909068da60e6ea8b3ebd9c09dd826def0e188c7a2da2" ,"f438ca355e6888c4c9cd7287b22cfe5773992ef83f0b16e72fb9ae239d85586c" ,"c305b3b3f9426d024cdd262497a5d196264397bfed445705759d0a793a58fe6e" ,"vncutil64.exe" ,"ApplicationLogs.exe" ,"msedge_proxyLog.exe" ,"vncutil64loc.dll" ,"atiadlxy.dll" ,"msedge_proxyLogLOC.dll" ,"cdb.exe" ,"nfdp.dll" ,"fdp.dll"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SHA256 has_any (IOCs) or SHA1 has_any (IOCs) or MD5 has_any (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs) or InitiatingProcessMD5 has_any (IOCs) or FolderPath has_any (IOCs) or ProcessName has_any (IOCs) or NewProcessName has_any (IOCs) or ParentProcessName has_any (IOCs) or InitiatingProcessFolderPath has_any (IOCs) or InitiatingProcessParentFileName has_any (IOCs) or InitiatingProcessFileName has_any (IOCs) or FileName has_any (IOCs) 
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP, DestinationIP, LocalIP, RemoteIP, SenderIPv4, RequestURL, Url, RemoteUrl, SHA256, SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256