let IOCs = dynamic(["e0e674ec74d323e0588973aae901b5d2" ,"298cbfc6a5f6fa041581233278af9394" ,"80e4a29270b828c1f97d9cde9475fcbd" ,"96ff508f9be007062b1770691f489e62" ,"a32dc85eee2e1a579199050cd1941e1d" ,"9f9dd5a432b4dde2160c7a7170e0d069"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SHA256 has_any (IOCs) or SHA1 has_any (IOCs) or MD5 has_any (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs) or InitiatingProcessMD5 has_any (IOCs) or FolderPath has_any (IOCs) or ProcessName has_any (IOCs) or NewProcessName has_any (IOCs) or ParentProcessName has_any (IOCs) or InitiatingProcessFolderPath has_any (IOCs) or InitiatingProcessParentFileName has_any (IOCs) or InitiatingProcessFileName has_any (IOCs) or FileName has_any (IOCs) 
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP, DestinationIP, LocalIP, RemoteIP, SenderIPv4, RequestURL, Url, RemoteUrl, SHA256, SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256