DeviceProcessEvents
| where TimeGenerated > ago(30d)
| where FileName in ("cmd.exe", "powershell.exe") and ProcessCommandLine has_any ("systeminfo", "whoami /all", "nltest /domain_trusts", "net user")
| project TimeGenerated, DeviceName, FileName, ProcessCommandLine, AccountName
| summarize count() by DeviceName, ProcessCommandLine
| order by count_ desc
| where ProcessCommandLine <> "cmd.exe /C \"net user sptserv **********"