DeviceFileEvents
| where Timestamp > ago(30d)
| where FileName =~ "zam64.sys"
| project Timestamp, DeviceName, FolderPath, FileName, SHA256, InitiatingProcessFileName, InitiatingProcessAccountName
| order by Timestamp desc