let IOCs = dynamic(["ntlmrelayx.exe" ,"secretsdump.exe" ,"PortBender.exe" ,"WinDivert.dll" ,"WinDivert64.sys" ,"aa.exe" ,"cc.exe" ,"av-1m.exe" ,"av-500kb.exe" ,"go.exe" ,"go2.exe" ,"crazyhunter.exe" ,"Prince-Built.exe" ,"crazyhunter.sys" ,"go3.exe" ,"hunter.exe" ,"hunter.ini" ,"gpo.exe" ,"appitob.exe" ,"beacon_x64.exe" ,"zam64.sys" ,"7f05a928c77cb87ffb510168c1b0b11b" ,"e12c5be075c23d1c5f398e46e2ee5d40" ,"87b3db166041c61f3a033cf3c94e89c6" ,"ca257aaa1ded22ca22086b9e95cb456d" ,"da1a93627cec6665ae28baaf23ff27c5" ,"b35813aac8a164e379f507de67c02a6f" ,"28bbd938ecbab26c4ad1ce96bbd9d1f5" ,"ba61c126dbbd7cde055d40e0e6b5d48f" ,"b2014d33ee645112d5dc16fe9d9fcbff" ,"89ed5be7ea83c01d0de33d3519944aa5" ,"6a70c22a5778eaa433b6ce44513068da" ,"5e560ea46fa48188cc8768c7e03294d0" ,"0937377d1ef1d47a04f1e55d929fe79c313d7640" ,"1b826a12a630e777aa2c3036f1159db15f2bdd66" ,"15823b729ad7aad20192ebe3fc1c21ea985001d7" ,"318a601a5d758dd870c38b8c4792a2c3405e6c28" ,"79c3fd97d33e114f8681c565f983cd8b8f9d8d93" ,"b6737248f7baed88177658598002df5433155450" ,"bed4229e774f136e1898fad9d37bd96e9156369e" ,"9e126627dff082000a830b8e2e04206ced8663ff" ,"086262abb7e85c43ffb6c384966d130ca612169b" ,"cd248648eafca6ef77c1b76237a6482f449f13be"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SHA256 has_any (IOCs) or SHA1 has_any (IOCs) or MD5 has_any (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs) or InitiatingProcessMD5 has_any (IOCs) or FolderPath has_any (IOCs) or ProcessName has_any (IOCs) or NewProcessName has_any (IOCs) or ParentProcessName has_any (IOCs) or InitiatingProcessFolderPath has_any (IOCs) or InitiatingProcessParentFileName has_any (IOCs) or InitiatingProcessFileName has_any (IOCs) or FileName has_any (IOCs) 
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP, DestinationIP, LocalIP, RemoteIP, SenderIPv4, RequestURL, Url, RemoteUrl, SHA256, SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256