DeviceProcessEvents
| where Timestamp > ago(30d)
| where FileName in~ ("ru.bat","go.exe","go2.exe","go3.exe","bb.exe","av-1m.exe","crazyhunter.exe")
| where FolderPath has_any (@"\ProgramData\", @"\AppData\", @"\Temp\", @"\Windows\Temp\")
| project Timestamp, DeviceName, AccountName, FileName, FolderPath, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine
| order by Timestamp desc