let IOCs = dynamic(["92.118.112.208" ,"173.44.141.226" ,"45.82.85.50" ,"38.180.195.187" ,"185.219.220.175" ,"193.203.49.90" ,"88.119.175.65" ,"104.238.61.144" ,"38.180.81.153" ,"185.33.86.15" ,"185.174.101.69" ,"162.252.173.12" ,"38.146.28.93" ,"185.174.101.240" ,"172.210.82.245" ,"butterflywonderland.com" ,"exclusive.nobogoods.com" ,"https://exclusive.nobogoods.com/updateStatus","8c9ccd071eefb8db81ded09a8fe1b6c1","26d657d25cc4d75bb862218906098227e1d003e2","0f0db5079a9fbd760bb24ee979e2e808b2dc089c17033310838474a53a267f04"]);
DeviceEvents | union DeviceProcessEvents | union DeviceFileEvents | union DeviceNetworkEvents | union SecurityEvent | union CommonSecurityLog | union EmailEvents | union EmailAttachmentInfo | union EmailUrlInfo | union UrlClickEvents | union SigninLogs
| where TimeGenerated > ago(30d)
| where SourceIP has_any (IOCs) or DestinationIP has_any (IOCs) or LocalIP has_any (IOCs) or RemoteIP has_any (IOCs) or SenderIPv4 has_any (IOCs) or RequestURL has_any (IOCs) or Url has_any (IOCs) or RemoteUrl has_any (IOCs) or SHA256 has_any (IOCs) or SHA1 has_all (IOCs) or InitiatingProcessSHA1 has_any (IOCs) or InitiatingProcessSHA256 has_any (IOCs)
| project-reorder Type, TimeGenerated, ActionType, DeviceAction, InitiatingProcessAccountName, AccountName, DeviceName, Computer, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, SourceIP ,DestinationIP ,LocalIP ,RemoteIP ,SenderIPv4 ,RequestURL ,Url ,RemoteUrl ,SHA256 ,SHA1, InitiatingProcessSHA1, InitiatingProcessSHA256